// C19_Struct3.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
// =========================================================
// < 구조체 자리 >
// =========================================================
struct YouBu{
    int rice;   //300 +-10
    int sugar;  // 10 +- 2
    int cho;    // 5 += 1
};
struct SpecialChoice{
    struct YouBu yb[9];
    int price; // 6000;
};
// ---------------------------------------------
// MyChew 구현
// 1. Crew -> int gram; 3?, int sugar; 2
// 2. MyChew -> Chew를 10개 가지고 있고, price는 1000원 책정.
// InitChew, PrintChew
// (추가예제) 이러한 MyChew를 여러개로 묶을 수 있는 MyChewBox 구현
struct Crew{
    int gram; 
    int sugar;
};
struct MyChew{
    struct Crew c[10];
    int price;
};

// =========================================================
// < 함수 자리 >
// =========================================================
void InitSC(struct SpecialChoice* sc){
    // 원본 구조체 변경 하는 곳 -> 원본이 변경되야함...!!!!
    (*sc).price = 6000;
    for(int i=0; i<9; i++){
        (*sc).yb[i].rice  = 300;
        (*sc).yb[i].sugar = 10 + rand()%3;  // + 2
        (*sc).yb[i].cho   = 5  + rand()%2;  // + 1
    }
}
void PrintSC(struct SpecialChoice sc){
    // 모든 요소 출력하는 놈.
    for(int i=0; i<9; i++){
        printf("--------------------\n");
        printf("R : %d, S : %d, C : %d\n",
                                        sc.yb[i].rice,
                                        sc.yb[i].sugar,
                                        sc.yb[i].cho 
        );
    }
}
void InitMC(struct MyChew* mc){
    // 원본 구조체 변경 하는 곳 -> 원본이 변경되야함...!!!!
    (*mc).price = 100;
    for(int i=0; i<10; i++){
        (*mc).c[i].gram  = 3;
        (*mc).c[i].sugar = 2;  // + 2
    }
}
void PrintMC(struct MyChew mc){
    // 모든 요소 출력하는 놈.
    for(int i=0; i<10; i++){
        printf("--------------------\n");
        printf("G : %d, S : %d\n",
                                        mc.c[i].gram,
                                        mc.c[i].sugar
        );
    }
}
// =========================================================
int main(){
    srand(time(NULL));
    // ----------------------------------------------------
    struct SpecialChoice sc;
    InitSC(&sc);
    // 유부초밥 출력 --------------------------------
    PrintSC(sc);
    // ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★  ★  ★  ★  ★  ★  ★ 
    // 위의 예제를 구조체가 아닌 것으로 만드려면?? 상상해보기
    // ---------------------------------------------------
    struct MyChew mc;
    InitMC(&mc);
    PrintMC(mc);
    // ---------------------------------------------------
    // - - - o - 0 
    // - - - - - 1
    // - - ○ - - 2
    // - - - - - 3 
    // - - - - - 4
    // 0 1 2 3 4
    // 2 2 입력 -> 2.2자리에 O
    // 또다시 입력 -> 입력받은 자리에 o 위치
    // Rock : x, y좌표 가지고 있음 + 출력을 뭐로 할지 저장 ( o )
    // Board : 25개 2차원 배열. Rock 여러개 최대 25개.

    // 모든 Rock은 순서대로 00, 01, 02, .... 좌표를 가지며 -를 가짐
    // 사용자가 입력한 좌표에 해당하는 Rock의 - -> o / 안전장치
    // 보드를 다시 출력 + 화면 초기화(검색)
    // 이후 다시 입력받기





}// ========================================================
/*----------------------------------------------------------
< 구조체 속 구조체의 속 구조체의 속 안의 구조체의 속... >
구조체 안에 다른 구조체를 넣을 수 있음 -> 변수 형태로!!
대신, 그 구조체는 위에 있어야 한다.
구조체 안의 구조체 안에 접근하려면 -> .구조체변수.멤버변수
----------------------------------------------------------*/